In [2]:
import pandas as pd
names=pd.read_csv("girls_name.csv", usecols=['Names'])
names.sort_values(by=['Names'],inplace=False)
names.head()

   Names
0   sara
1   noor
2   iqra
3   aqsa
4  maria

In [4]:
names.sort_index(inplace=True)
names.head()

   Names
0   sara
1   noor
2   iqra
3   aqsa
4  maria